Revit 2024 API
DefaultDivideSettings.SetSurfaceLayout Method
 Sets the default Divided Surface layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void SetSurfaceLayout(
	UVGridlineType gridlines,
	SpacingRuleLayout layout
)
Visual Basic
Public Sub SetSurfaceLayout ( _
	gridlines As UVGridlineType, _
	layout As SpacingRuleLayout _
)
Visual C++
public:
void SetSurfaceLayout(
	UVGridlineType gridlines,
	SpacingRuleLayout layout
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
layout
Type: Autodesk.Revit.DB.SpacingRuleLayout
 A layout spacing rule.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace